/*
 * =====================================================================================
 *
 *       Filename:  main.cc
 *
 *    Description:  
 *
 *        Version:  1.0
 *        Created:  2017년 07월 05일 15시 41분 38초
 *       Revision:  none
 *       Compiler:  gcc
 *
 *         Author:  Hobum (Vincent) Kwon (mn), hobum.kwon@gmail.com
 *        Company:  Samsung Electornics
 *
 * 0 - 1 - 2
 * |  / \  |
 * 3      4
 * 
 * {0, 1, 0, 1, 0},
 * {1, 0, 1, 1, 1},
 * {0, 1, 0, 0, 1},
 * {1, 1, 0, 0, 1}, 
 * {0, 1, 1, 1, 0}
 *
 * {0, 1, 0, 1, 0},
 * {1, 0, 1, 1, 1},
 * {0, 1, 0, 0, 1},
 * {1, 1, 0, 0, 0},
 * {0, 1, 1, 0, 0}
 *
 * find Hamiltonian circle or path 
 * =====================================================================================
 */


